"SPC Password" = "SPC-salasana";
"Authentication Key" = "Todentamisavain";
"Incorrect key" = "Väärä avain";
"Incorrect SPC Password" = "Väärä SPC-salasana";
"Enter 26 digit key" = "Syötä 26-numeroinen todentamisavain.";
"Security" = "Suojaus";
"Too many retries of SPC." = "Liian monta SPC-yritystä.";
"AKEY set successfully." = "AKEYn asetus onnistui.";
"Failed to set AKEY." = "AKEYn asetus epäonnistui.";
"Too many retries of AKEY." = "Liian monta AKEY-yritystä.";
"Password" = "Salasana";
"Key" = "Avain";
"OK" = "OK";
"Cancel" = "Kumoa";